{
  "backend/main.mo": "Motoko canister implementing user authorization, profile storage, and CRUD operations for dated entry records with validation and stable memory handling.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend source files including utilities, components, and configuration.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Root React component rendering DataEntryPage and global Toaster notifications.",
  "frontend/src/components/AnalyticsSection.tsx": "Analytics UI component showing monthly or yearly bar charts based on aggregated entry data.",
  "frontend/src/components/AuthStatusBar.tsx": "Authentication status bar showing sign‑in state and providing Internet Identity login/logout actions.",
  "frontend/src/components/EntriesTable.tsx": "Displays entries in a table with edit/delete dialogs and form validation, using update and delete mutations.",
  "frontend/src/features/entries/queries.ts": "Defines React Query hooks for listing, creating, updating, and deleting entries with authorization-aware error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and state tracking.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and a light/dark theme with custom CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/DataEntryPage.tsx": "Implements the main data entry UI with validation, entry creation, imports/exports, and entries display.",
  "frontend/src/types/jspdf.d.ts": "Empty type declaration placeholder for jsPDF.",
  "frontend/src/types/xlsx.d.ts": "Empty type declaration placeholder for XLSX.",
  "frontend/src/utils/analytics.ts": "Provides helpers to aggregate entries by month and year and extract available years.",
  "frontend/src/utils/authErrors.ts": "Provides helpers to detect authorization errors and return predefined sign‑in prompt messages.",
  "frontend/src/utils/date.ts": "Parses YYYY‑MM‑DD strings to Date objects and computes whole‑day differences from today.",
  "frontend/src/utils/entriesCSVImport.ts": "Parses and validates CSV rows into structured entry data, mapping headers and collecting errors.",
  "frontend/src/utils/entriesImportExport.ts": "Builds export rows and supports CSV and text table export of entries, including timestamp formatting.",
  "frontend/src/utils/entriesPdfExport.ts": "Generates a printable HTML table for entries and opens it for browser PDF printing.",
  "frontend/src/utils/entriesXlsxExport.ts": "Exports entries as CSV-formatted data with .xlsx filename for Excel compatibility.",
  "frontend/src/utils/entriesXlsxImport.ts": "Parses XLSX/CSV files as CSV text, mapping headers and validating rows into structured entry data.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash routing.",
  "frontend/src/utils/validation.ts": "Provides validation helpers for required fields, mobile numbers, and amounts, returning structured ValidationResult objects.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended colors, fonts, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project state, existing features, issues, and architectural notes for expanding the app to full CRUD with import/export and improved auth handling."
}